In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.set_option('display.max_rows',100)

In [4]:
df1 = pd.read_excel('homelessness/Table_784_2017_18.xlsx',sheet_name='2008-09',header=12)
df1.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,thousands,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25
0,E92000001,ENGLAND,NaN,NaN,21514.739,37310,6630,3310,3360,2820,...,112900,NaN,2450,5170,10480,37450,8460,64000.0,2.974705,5560
1,E12000007,LONDON,NaN,NaN,3178.194,4780,4020,1410,1560,1000,...,27290,NaN,1160,2490,4690,32670,6760,47780.0,15.033695,1570
2,-,REST OF ENGLAND,NaN,NaN,18336.545,32530,2610,1900,1800,1820,...,85610,NaN,1290,2680,5790,4780,1700,16220.0,0.884572,3990
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,E12000001,NORTH EAST,NaN,NaN,1109.904,2870,80,70,60,60,...,5450,NaN,50,30,200,10,0,300.0,0.270294,420

In [5]:
columns = ['LA_code','LA','r1','r2','households','r3','r4','r5','r6','r7','homeless_acc','r8','homeless_pm','r9','r10','r11','r12','r13','r14',
'r15','r16','r17','r18','TA','TA_pm','no_accom']

In [9]:
df1.columns = columns
df1.head()

,LA_code,LA,r1,r2,households,r3,r4,r5,r6,r7,...,r12,r13,r14,r15,r16,r17,r18,TA,TA_pm,no_accom
0,E92000001,ENGLAND,NaN,NaN,21514.739,37310,6630,3310,3360,2820,...,112900,NaN,2450,5170,10480,37450,8460,64000.0,2.974705,5560
1,E12000007,LONDON,NaN,NaN,3178.194,4780,4020,1410,1560,1000,...,27290,NaN,1160,2490,4690,32670,6760,47780.0,15.033695,1570
2,-,REST OF ENGLAND,NaN,NaN,18336.545,32530,2610,1900,1800,1820,...,85610,NaN,1290,2680,5790,4780,1700,16220.0,0.884572,3990
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,E12000001,NORTH EAST,NaN,NaN,1109.904,2870,80,70,60,60,...,5450,NaN,50,30,200,10,0,300.0,0.270294,420

In [12]:
for x in df1.columns:
    if x.startswith('r'):
        df1.drop(columns=x,inplace=True)
df1.head()

,LA_code,LA,households,homeless_acc,homeless_pm,TA,TA_pm,no_accom
0,E92000001,ENGLAND,21514.739,53430,2.483414,64000.0,2.974705,5560
1,E12000007,LONDON,3178.194,12780,4.021152,47780.0,15.033695,1570
2,-,REST OF ENGLAND,18336.545,40650,2.216884,16220.0,0.884572,3990
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,E12000001,NORTH EAST,1109.904,3140,2.829074,300.0,0.270294,420

In [19]:
df1 = df1[4:468]

In [21]:
df1 = df1[~df1.loc[:,'LA_code'].isnull()]
df1.reset_index(drop=True,inplace=True)

In [27]:
for x in range(len(df1)):
    if df1.loc[x,'LA_code'].startswith('E1'):
        df1.drop(x,axis=0,inplace=True)

In [29]:
df1.head()

,LA_code,LA,households,homeless_acc,homeless_pm,TA,TA_pm,no_accom
1,E06000005,Darlington,43.772,18,0.411222,0.0,0,2
2,E06000001,Hartlepool,39.291,28,0.712631,0.0,0,4
3,E06000002,Middlesbrough,58.167,30,0.515756,6.0,0.103151,1
4,E06000003,Redcar and Cleveland,59.126,55,0.930217,15.0,0.253695,19
5,E06000004,Stockton-on-Tees,79.105,416,5.258833,60.0,0.758486,85